posts/poems.2024-02-29(2).org
#+title: Hold my hand as quicksand falls
#+begin_export html
<p class="subtitle">2024-02-29</p>
#+end_export

#+begin_verse
Hold my hand as quicksand falls.
Baggage weighs me but still I move.
What obstruction lurks my thought or speech?
Clearly none that others see.

I beam proud my stride again each day;
dissuade notions of /he's all but okay/.
Hear me: I'm okay, I'll preach I'm fine.
You'll dare reach over once I've laid that line.

Disdain runs deep, marks those worded lies.
But away from crowds, alone I arrive.
The day is ending, the sand is sifting.
Now I'm sinking through the pores of the night.

Where silence creeps and stirs unrest.
My chest compressed as I reflect,
each stride and preach and thing I've said.
I'm out of breath.
Hold my hand as quicksand falls.
#+end_verse
