poems.2024-02-29(2).html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-29 Thu 20:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Hold my hand as quicksand falls</title>
<meta name="generator" content="Org mode" />
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='./css/tufte.css' />
<link rel='stylesheet' href='./css/header.css' />
<!-- Google tag (gtag.js) -->
</head>
<body>
<div id="preamble" class="status">
<div class="banner">
  <div id="l_app" style="float:left"></div>
  <a id="myname" href="/">Tomaz Geddes de Almeida</a>
  <div id="r_app" style="float:left"></div>
  
  <hr/>
  <nav>
    <p>
      <a href="/">Home</a>
      <a href="/about.html">About</a>
      <a href="/blog-index.html">Writing</a>
      <a href="https://github.com/tomazgda/">Github</a>
    </p>
  </nav>
</div>

<script>
  var l_app = Elm.Cube.init({
      node: document.getElementById('l_app')
  });
  var r_app = Elm.Cube.init({
      node: document.getElementById('r_app')
  });
</script>
</div>
<div id="content">
<h1 class="title">Hold my hand as quicksand falls</h1>
<p class="subtitle">2024-02-29</p>

<p class="verse">
Hold my hand as quicksand falls.<br />
Baggage weighs me but still I move.<br />
What obstruction lurks my thought or speech?<br />
Clearly none that others see.<br />
<br />
I beam proud my stride again each day;<br />
dissuade notions of <i>he’s all but okay</i>.<br />
Hear me: I’m okay, I’ll preach I’m fine.<br />
You’ll dare reach over once I’ve laid that line.<br />
<br />
Disdain runs deep, marks those worded lies.<br />
But away from crowds, alone I arrive.<br />
The day is ending, the sand is sifting.<br />
Now I’m sinking through the pores of the night.<br />
<br />
Where silence creeps and stirs unrest.<br />
My chest compressed as I reflect,<br />
each stride and preach and thing I’ve said.<br />
I’m out of breath.<br />
Hold my hand as quicksand falls.<br />
</p>
</div>
<div id="postamble" class="status">
<hr />

Bring back the blogosphere!
</div>
</body>
</html>
